; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	spectrograph0 - mode
	infrared1 - mode
	Star4 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation7 - direction
	Star3 - direction
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star6)
	(supports instrument2 infrared1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation7)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation7)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 Star0)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star0)
	(supports instrument6 spectrograph0)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
)
(:goal (and
	(pointing satellite0 Star3)
	(pointing satellite1 Phenomenon13)
	(pointing satellite2 Star8)
	(have_image Star8 spectrograph0)
	(have_image Planet9 infrared1)
	(have_image Phenomenon10 spectrograph0)
	(have_image Phenomenon11 infrared1)
	(have_image Planet12 spectrograph0)
	(have_image Phenomenon13 spectrograph0)
	(have_image Star14 spectrograph0)
	(have_image Planet15 infrared1)
))

)

; plan
1. (turn_to satellite1 star6 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 star6)
   goals met: 0 of 11
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 11
3. (calibrate satellite1 instrument1 star6)
   added: (calibrated instrument1)
   goals met: 0 of 11
4. (turn_to satellite1 planet12 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 planet12)
   goals met: 0 of 11
5. (take_image satellite1 planet12 instrument1 spectrograph0)
   added: (have_image planet12 spectrograph0)
   goals met: 1 of 11
6. (turn_to satellite1 phenomenon11 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 phenomenon11)
   goals met: 1 of 11
7. (take_image satellite1 phenomenon11 instrument1 infrared1)
   added: (have_image phenomenon11 infrared1)
   goals met: 2 of 11
8. (turn_to satellite1 phenomenon10 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 11
9. (turn_to satellite0 star3 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star3)
   goals met: 3 of 11
10. (take_image satellite1 phenomenon10 instrument1 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 4 of 11
11. (turn_to satellite1 planet15 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet15)
   goals met: 4 of 11
12. (take_image satellite1 planet15 instrument1 infrared1)
   added: (have_image planet15 infrared1)
   goals met: 5 of 11
13. (turn_to satellite1 planet9 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet9)
   goals met: 5 of 11
14. (take_image satellite1 planet9 instrument1 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 6 of 11
15. (turn_to satellite1 star14 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star14)
   goals met: 6 of 11
16. (take_image satellite1 star14 instrument1 spectrograph0)
   added: (have_image star14 spectrograph0)
   goals met: 7 of 11
17. (turn_to satellite1 star8 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star8)
   goals met: 7 of 11
18. (take_image satellite1 star8 instrument1 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 8 of 11
19. (turn_to satellite1 phenomenon13 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 phenomenon13)
   goals met: 9 of 11
20. (take_image satellite1 phenomenon13 instrument1 spectrograph0)
   added: (have_image phenomenon13 spectrograph0)
   goals met: 10 of 11
21. (turn_to satellite2 star8 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 star8)
   goals met: 11 of 11
